package com.example.richtextviewdemo.recursion

/**
 *
 * @ClassName: RecursionUtil
 * @Author: szj
 * @CreateDate: 7/9/21 11:02 AM
 * @UpdateRemark: 更新说明
 * @Version: 1.0
 */
object  RecursionUtil {

    val data = """
        {
            "code": 0,
            "msg": "success",
            "data": [
                {
                    "name": "安全环保部",
                    "childs": [
                        {
                            "name": "消防队",
                            "id": "2351",
                            "childs": [
                                {
                                    "name": "一班",
                                    "id": "2919"
                                },
                                {
                                    "name": "二班",
                                    "id": "2920"
                                },
                                {
                                    "id": "2351",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "安全管理科",
                            "id": "2349"
                        },
                        {
                            "name": "环保管理科",
                            "id": "2350"
                        },
                        {
                            "name": "安全督查科",
                            "id": "2352"
                        },
                        {
                            "id": "2331",
                            "name": "全部"
                        }
                    ],
                    "id": "2331"
                },
                {
                    "name": "锦源化工有限公司",
                    "childs": [
                        {
                            "name": "热电分厂",
                            "id": "2550",
                            "childs": [
                                {
                                    "name": "热机工段",
                                    "id": "2564",
                                    "childs": [
                                        {
                                            "name": "运行一班",
                                            "id": "2868"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2870"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2871"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2872"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2869"
                                        },
                                        {
                                            "id": "2564",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "电气工段",
                                    "id": "2563",
                                    "childs": [
                                        {
                                            "name": "运行三班",
                                            "id": "2865"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2863"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2867"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2866"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2864"
                                        },
                                        {
                                            "id": "2563",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "脱硫工段",
                                    "id": "2566",
                                    "childs": [
                                        {
                                            "name": "运行一班",
                                            "id": "2878"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2879"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2880"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2881"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2882"
                                        },
                                        {
                                            "id": "2566",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "燃运工段",
                                    "id": "2561",
                                    "childs": [
                                        {
                                            "name": "运行一班",
                                            "id": "2854"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2853"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2856"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2857"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2855"
                                        },
                                        {
                                            "id": "2561",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "检修工段",
                                    "id": "2565",
                                    "childs": [
                                        {
                                            "name": "运行二班",
                                            "id": "2874"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2875"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2877"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2873"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2876"
                                        },
                                        {
                                            "id": "2565",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "公用工段",
                                    "id": "2562",
                                    "childs": [
                                        {
                                            "name": "运行一班",
                                            "id": "2858"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2859"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2860"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2861"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2862"
                                        },
                                        {
                                            "id": "2562",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2550",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "安全环保科",
                            "id": "2544"
                        },
                        {
                            "name": "原料分厂",
                            "id": "2551",
                            "childs": [
                                {
                                    "name": "烘干工段",
                                    "id": "2557",
                                    "childs": [
                                        {
                                            "name": "运行三班",
                                            "id": "2904"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2901"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2903"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2905"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2902"
                                        },
                                        {
                                            "id": "2557",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "白灰工段",
                                    "id": "2558",
                                    "childs": [
                                        {
                                            "name": "运行四班",
                                            "id": "2910"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2907"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2906"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2908"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2909"
                                        },
                                        {
                                            "id": "2558",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "检修工段",
                                    "id": "2560",
                                    "childs": [
                                        {
                                            "name": "白班",
                                            "id": "2896"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2898"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2900"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2897"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2899"
                                        },
                                        {
                                            "id": "2560",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "碳化工段",
                                    "id": "2559",
                                    "childs": [
                                        {
                                            "name": "白班",
                                            "id": "2911"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2913"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2915"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2914"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2912"
                                        },
                                        {
                                            "id": "2559",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2551",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "电石分厂",
                            "id": "2552",
                            "childs": [
                                {
                                    "name": "检修工段",
                                    "id": "2556",
                                    "childs": [
                                        {
                                            "name": "白班",
                                            "id": "2851"
                                        },
                                        {
                                            "name": "制筒班",
                                            "id": "2852"
                                        },
                                        {
                                            "id": "2556",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "电石三工段",
                                    "id": "2555",
                                    "childs": [
                                        {
                                            "name": "运行四班",
                                            "id": "2850"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2848"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2847"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2846"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2849"
                                        },
                                        {
                                            "id": "2555",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "电石二工段",
                                    "id": "2554",
                                    "childs": [
                                        {
                                            "name": "运行四班",
                                            "id": "2845"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2842"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2841"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2843"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2844"
                                        },
                                        {
                                            "id": "2554",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "电石一工段",
                                    "id": "2553",
                                    "childs": [
                                        {
                                            "name": "运行二班",
                                            "id": "2838"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2839"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2840"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2836"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2837"
                                        },
                                        {
                                            "id": "2553",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2552",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "设备管理科",
                            "id": "2549",
                            "childs": [
                                {
                                    "name": "仪表检修工段",
                                    "id": "2568",
                                    "childs": [
                                        {
                                            "name": "运行一班",
                                            "id": "2888"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2889"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2890"
                                        },
                                        {
                                            "name": "白班",
                                            "id": "2887"
                                        },
                                        {
                                            "id": "2568",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "name": "电气检修工段",
                                    "id": "2567",
                                    "childs": [
                                        {
                                            "name": "白班",
                                            "id": "2883"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2884"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2885"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2886"
                                        },
                                        {
                                            "id": "2567",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2549",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "生产技术科",
                            "id": "2547",
                            "childs": [
                                {
                                    "name": "化验室",
                                    "id": "2570",
                                    "childs": [
                                        {
                                            "name": "白班",
                                            "id": "2786"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2790"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2788"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2787"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2789"
                                        },
                                        {
                                            "id": "2570",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2547",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "物资管理科",
                            "id": "2546",
                            "childs": [
                                {
                                    "name": "发运组",
                                    "id": "2573"
                                },
                                {
                                    "name": "材料组",
                                    "id": "2572"
                                },
                                {
                                    "name": "原料组",
                                    "id": "2571",
                                    "childs": [
                                        {
                                            "name": "白班",
                                            "id": "2891"
                                        },
                                        {
                                            "name": "运行三班",
                                            "id": "2894"
                                        },
                                        {
                                            "name": "运行一班",
                                            "id": "2892"
                                        },
                                        {
                                            "name": "运行四班",
                                            "id": "2895"
                                        },
                                        {
                                            "name": "运行二班",
                                            "id": "2893"
                                        },
                                        {
                                            "id": "2571",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2546",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "病休人员",
                            "id": "3108"
                        },
                        {
                            "name": "综合管理科",
                            "id": "2548",
                            "childs": [
                                {
                                    "name": "治安队",
                                    "id": "2569",
                                    "childs": [
                                        {
                                            "name": "二班",
                                            "id": "2952"
                                        },
                                        {
                                            "name": "三班",
                                            "id": "2953"
                                        },
                                        {
                                            "name": "一班",
                                            "id": "2951"
                                        },
                                        {
                                            "id": "2569",
                                            "name": "全部"
                                        }
                                    ]
                                },
                                {
                                    "id": "2548",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "name": "财务管理科",
                            "id": "2545"
                        },
                        {
                            "id": "2368",
                            "name": "全部"
                        }
                    ],
                    "id": "2368"
                },
                {
                    "name": "营销物流部",
                    "childs": [
                        {
                            "name": "PVC销售科",
                            "id": "2363"
                        },
                        {
                            "name": "碱氯酸销售科",
                            "id": "2364"
                        },
                        {
                            "id": "2336",
                            "name": "全部"
                        }
                    ],
                    "id": "2336"
                },
                {
                    "name": "财务管理部",
                    "childs": [
                        {
                            "name": "预算管理科",
                            "id": "2346"
                        },
                        {
                            "name": "会计核算科",
                            "id": "2347"
                        },
                        {
                            "name": "资金管理科",
                            "id": "2348"
                        },
                        {
                            "id": "2330",
                            "name": "全部"
                        }
                    ],
                    "id": "2330"
                },
                {
                    "name": "党群工作部",
                    "id": "2327"
                },
                {
                    "name": "综合管理部",
                    "childs": [
                        {
                            "name": "行政管理科",
                            "id": "2337"
                        },
                        {
                            "name": "后勤管理科",
                            "id": "2339"
                        },
                        {
                            "name": "信息管理科",
                            "id": "2338"
                        },
                        {
                            "name": "物业保卫科",
                            "id": "2340",
                            "childs": [
                                {
                                    "name": "三班",
                                    "id": "2918"
                                },
                                {
                                    "name": "二班",
                                    "id": "2917"
                                },
                                {
                                    "name": "一班",
                                    "id": "2916"
                                },
                                {
                                    "id": "2340",
                                    "name": "全部"
                                }
                            ]
                        },
                        {
                            "id": "2326",
                            "name": "全部"
                        }
                    ],
                    "id": "2326"
                },
                {
                    "name": "科技研发中心",
                    "childs": [
                        {
                            "name": "研发室",
                            "id": "2362"
                        },
                        {
                            "name": "分析室",
                            "id": "2360"
                        },
                        {
                            "name": "设计室",
                            "id": "2361"
                        },
                        {
                            "name": "综合室",
                            "id": "2359"
                        },
                        {
                            "id": "2335",
                            "name": "全部"
                        }
                    ],
                    "id": "2335"
                },
                {
                    "name": "生产技术部",
                    "childs": [
                        {
                            "name": "生产管理科",
                            "id": "2353"
                        },
                        {
                            "name": "调度中心",
                            "id": "2355"
                        },
                        {
                            "name": "质量管理科",
                            "id": "2354"
                        },
                        {
                            "id": "2332",
                            "name": "全部"
                        }
                    ],
                    "id": "2332"
                }
            ]
        }
    """.trimIndent()

}